---
kind: other
id: Methods.T:Autodesk.Revit.DB.CancellationListener
source: html/56f7d37a-bc1a-222d-9c03-b9e779a5d644.htm
---
# CancellationListener Methods

Returns true if the operation associated with this instance has been cancelled.